export const state = () => ({
  _scrollTop: 0,
  _listeners: [],
  _lang: "RU",
  _translate: {
    "RU": {
      backAgain: "Главная страница",
      navMenuItemAbout: "О нас",
      navMenuItemCompany: "О компании",
      navMenuItemTeam: "О команде",
      navMenuItemMedia: "Медиа",
      navMenuItemDemo: "Демо",
      btnMenu: "Меню",
      bannerTitleFirst: "Цифровые",
      bannerTitleSecond: "технологии",
      bannerTitleThird: "в образовании",
      bannerTextFirst: "Разработка цифровых образовательных ресурсов для обучения сотрудников.",
      bannerTextSecond: "Автоматизация проверки знаний, сбора статистики и выставления оценок.",
      btnDemo: "Демо",
      videoInfoTitle: "Как это работает?",
      videoInfoTextTitle: "Цифровизация в образовании",
      videpInfoTextFirst: "- это не просто перевод обучения в электронный формат. Наши курсы способствуют трансформации всей инфраструктуры компании, делая разные аспекты ее работы более эффективными.",
      videpInfoTextSecond: "Благодаря мультимедийному сопровождению занятий, экономится до 30% учебного времени.",
      videpInfoTextThird: "HR-департамент получает мощный инструмент аналитики, который позволяет оценивать знания и навыки сотрудников.",
      approachTitle: "НАШ ПОДХОД",
      approachSlides: [{
          id: "1",
          title: "Этап анализа",
          text: "Процесс обучения — это путь от точки А до точки В и в конце этого пути наш слушатель должен не только приобрести новые знания и умения, но и наработать новые навыки. Важной частью разработки эффективного курса является проведение анализа. Эта стадия разбивается на несколько этапов: анализ потребностей, анализ целевой аудитории и анализ задач обучения и контента.",
        },
        {
          id: "2",
          title: "Составление концепта",
          text: "Структура будущего курса — маршрутная карта для достижения учебной цели курса. На этом этапе формируются образовательные цели и задачи, которые нужно решить в процессе реализации проекта, закладывается логика подачи материала и используемых интерактивов, выявляется формат подачи информации, основные линии сюжета и способы оценивания.",
        },
        {
          id: "3",
          title: "Разработка сценария",
          text: "В сценарии описывается формат будущего ЦОРа, при написании которого важно знать когнитивный подход в обучении и методику предоставления учебного материала. Необходимо учитывать особенности восприятия материала, как человек лучше запоминает его, как формируются умения и навыки, а также как удержать вовлеченность слушателя при прохождении курса.",
        },
        {
          id: "4",
          title: "Разработка дизайна",
          text: "Разработанный сценарий воплощается в уникальную визуализацию курса на этапе разработки дизайна. На данном этапе визуализируются от самой маленькой кнопки до 3D объектов, оформляются интерфейс курса, рисуются все нужные элементы. Разработанный дизайн курса — это готовый вид будущего курса, но без интерактивности и функциональности элементов.",
        },
        {
          id: "5",
          title: "Разработка платформы",
          text: "Разработчики переводят готовый дизайн в рабочий проект. Ресурс получает жизнь, становится динамичным. Появляется возможность пользоваться интерактивом, реализовывать разные действия. На этапе верстки разрабатывается адаптивная версия сайта, которая открывается на разных браузерах с разными расширениями.",
        },
        {
          id: "6",
          title: "Тестирование проекта",
          text: "Тестирование курса необходимо для выявления ошибок и их исправления, улучшения всего процесса обучения перед финальной сдачей заказчику. Тестируем и проверяем все: насколько удобны и эффективны интерфейс и навигация, как отображается картинка и звук, все ли кнопки работают, понятна ли логика курса и наконец, комфортно ли чувствует себя слушатель при прохождении ЦОРа.",
        },
      ],
      counterTitle: "почему мы",
      counterItemFirst: "Лет опыта",
      counterItemSecond: "Сотрудников обученно",
      counterItemThird: "Проектов выполнено",
      teamSlides: [{
          id: "0",
          title: "Педдизайнеры",
          text: [
            "E-learning — это про людей: делаем курс так, чтобы люди работали лучше, не допускали ошибок, были мотивированы учиться.",
            "И еще это про бизнес: чем эффективнее работник, тем круче компания! И первый шаг к созданию такого курса делает педдизайнер, работа которого начинается с разработки сценария.",
          ],
          img: "./images/team/team1.jpg",
        },
        {
          id: "1",
          title: "Дизайнеры",
          text: [
            "Наша команда дизайнеров делает каждый курс уникальным, понятным и доступным, придумывая концепцию будущего дизайна.",
            "Визуализация идей, используя цвет, иллюстрацию, графику, анимацию, создание фирменного стиля, 3D объектов, интерфейс— малая часть нашей творческой работы.",
          ],
          img: "./images/team/team2.jpg",
        },
        {
          id: "2",
          title: "Разработчики",
          text: [
            "Внедрение цифровых технологий в обучение — это не просто перевод обучающих материалов в электронный формат.",
            "Но в тоже время это является одним из важных этапов всего процесса. Наши разработчики переводят идеи дизайнеров на язык программирования, реализуя все желания и требования заказчика.",
          ],
          img: "./images/team/team3.jpg",
        },
        {
          id: "3",
          title: "Проектные менеджеры",
          text: [
            "Основная обязанность PM — довести идею до реализации в срок, используя все ресурсы. Звучит довольно мирно, но за каждым словом скрывается целый ряд непростых задач.",
            "Наши менеджеры видят проект целиком. Учитывают риски. Строят дорожную карту, полностью учитывая потребности клиента. С начала до конца организуя процесс.",
          ],
          img: "./images/team/team4.jpg",
        },
      ],
      demoTitle: "Наши работы",
      footerDataLegend: "Наши данные",
      footerAddressLegend: "Наш адресс",
      address: "Кабанбай батыра 5/1",
      footerEmailCaption: "Написать нам:",
      footerCopyright: "©2021 CACG. все права защищены",
      footerVerify: "Проверено <a href = '#'> <img style='margin-left: 0.5rem;vertical-align: middle' src='/images/astana-hub-logo.png' alt = '' /> </a>",
      componyTitle: "О компании",
      componyMainText: "CA Consulting Group создает обучающие цифровые продукты в сфере e-learning. Мы помогаем компаниям обучать, аттестовывать и повышать квалификацию сотрудников, от которых требуются сложные технические навыки и знания. Наши клиенты экономят время и деньги на регулярных курсах обучения, переаттестациях и командировках, получая вместо этого удобное и технологичное решение с возможностью быстро обновлять содержание обучающих курсов.",
      componyChronology: [{
          id: "0",
          year: "2011",
          text: "Начало формирования нашей компании. У нас было четкое видение того, что мы хотим и как мы будем разрабатывать образовательные курсы (ЦОР).",
        },
        {
          id: "1",
          year: "2013",
          text: "Официальное открытие компании и начало новых проектов. К этому времени было реализовано несколько ЦОР и одним из больших проектов была работа над образовательным продуктом для НИШ.",
        },
      ],
      componySecondTitle: "Наши услуги",
      componyServices: [{
          title: "проектное управление",
          text: [
            "<p>Управление проектами одна из основ проекта. Проектные менеджера готовы довести идею до реализации в срок, используя все ресурсы. Звучит довольно мирно, но за каждым словом скрывается целый ряд непростых задач. Наши менеджеры ведут проект с начала и до конца: просчитывают риски, строят дорожную карту, учитывая потребности клиента, организовывают процесс разработки курса.</p>",
          ],
        },
        {
          title: "Составление учебного материала",
          text: [
            "<p>Педдизайнеры тщательно изучают материалы, предоставленные заказчиком. Обычно это большие объемы информации, которые надо переработать и структурировать. Затем выстраивается концепт, логика, подбираются нужные инструменты для его подачи и на основе всего этого готовится сценарий курса. Мы привлекаем эксперта в предметной области, разрабатываем уникальный дизайн, кастомизируем отчетность под конкретные задачи заказчика.</p>",
            "<p>В процессе обучения сотрудник активно выполняет практические задания, изучает 3D-модели сложных механизмов, которые можно рассмотреть с разных сторон и разобрать на части, проверяет и закрепляет свои знания.</p>"
          ],
        },
        {
          title: "Разработка дизайна",
          text: [
            "<p>В нашей команде есть широкий выбор специалистов: графический, UX&UI, motion дизайнеры и 3D визуализаторы. Наша команда дизайнеров делают не только курсы, но и отдельные сайты, открытки. </p>",
            "<p>Благодаря дизайнерам каждый проект становиться уникальным, понятным и доступным. Визуализация идей, используя цвет, иллюстрацию, графику, анимацию, создание фирменного стиля, 3D объектов, интерфейс— малая часть нашей творческой работы.</p>"
          ],
        },
        {
          title: "Разработка ЦОР",
          text: [
            "<p>Внедрение цифровых технологий в обучение — это не просто перевод обучающих материалов в электронный формат. Но в тоже время это является одним из важных этапов всего процесса. Наши разработчики переводят идеи дизайнеров на язык программирования, реализуя все желания и требования заказчика.</p>",
            "<p></p>"
          ],
        },
      ],
      componyTechnologies: [{
        src: "/images/technology-vue.png",
        title: "Vue.js framework",
        text: [
          "JavaScript-фреймворк с открытым исходным кодом для создания пользовательских интерфейсов. Легко интегрируется в проекты с использованием других JavaScript-библиотек. Может функционировать как веб-фреймворк для разработки одностраничных приложений в реактивном стиле.",
        ],
      }, ],
      componyThirdTitle: "Стэк технологий",
      teamTitle: "О команде",
      teamMainText: "Над реализацией проектов в нашей команде работают 20 сотрудников. Каждый из них – успешная личность и профессионал своего дела, а вместе мы – сильная команда!",
      teamPageSlides: [{
          id: "0",
          src: "./images/team/team1.jpg",
        },
        {
          id: "1",
          src: "./images/team/team2.jpg",
        },
        {
          id: "2",
          src: "./images/team/team3.jpg",
        },
        {
          id: "3",
          src: "./images/team/team4.jpg",
        },
        {
          id: "4",
          src: "./images/team/team5.jpg",
        },
        {
          id: "5",
          src: "./images/team/team6.jpg",
        },
        {
          id: "6",
          src: "./images/team/team7.jpg",
        },
      ],
      teamSecondTitle: "Наши принципы",
      teamPrinciples: [{
          id: "1",
          text: "Мы одна большая семья, единый организм. Если болит нога, плачут глаза - руки вытирают слезы:)"
        },
        {
          id: "2",
          text: "Взаимопомощь - наша основа."
        }, {
          id: "3",
          text: "Креативность и инициативность приветствуются всегда."
        }, {
          id: "4",
          text: "Мы за новшества, если это удобно и совпадает с нашими ценностями!"
        }
      ],
      teamThirdTitle: "Актуальные вакансии",
      teamVacancies: [{
        title: "Дизайнер 3D",
        type: "vacancies",
        text: [
          `<span>Обязанности:</span><ul><li>3D моделирование необходимых объектов для дальнейшей визуализации</li><li>Разработка 3D сцены</li><li>Разработка объектов под специфику VR(это крутая возможность обучиться чему-то новому☺️)</li></ul>`,
          `<span>Требования:</span><ul><li>Наличие опыта моделирования 3D-объектов, их анимирования, текстурирования, настройки света и камер;</li><li>Владение как минимум двумя из нижеперечисленных программных пакетов (3ds Max, Cinema 4D, Blender, Adobe PhotoShop);</li><li>Креативное мышление</li></ul>`,
          `<span>Условия:</span><ul><li>Официальное трудоустройство</li><li>Уютная, теплая атмосфера в коллективе</li><li>Кофе, чай, печеньки)</li><li>Возможность обучения разработки моделей для пространства VR(есть своя специфика). Будет менторское сопровождение из России.</li><li>Заработная плата обсуждается на собеседовании (зависит от опыта, скорости и качества работы)</li></ul>`,
        ],
      }],
      teamFourTitle: "Хочу у вас работать",
      formEndText: "<p>спасибо!</p> <p>Мы с вами свяжемся</p>",
      formNameLabel: "Ваше имя",
      formNameError: "Имя не введено",
      formPositionLabel: "позиция",
      formPositionDefaultValue: "Не выбрано",
      formPositions: [
        "Графический дизайнер",
        "Моушн дизайнер",
        "Front end программист",
      ],
      formFileLabel: "Резюме",
      formFileDefaultValue: "Файл не выбран",
      formFileError: "Файл не должен превышать 10 мб",
      formBtn: "Отправить",
      demoPageTitle: "Демо",
      demoMainText: "Демо – это предварительная версия проектов, представленных будущему заказчику. Здесь мы демонстрируем возможности всех подразделений компании, показываем логику выстраивания курса, отталкиваясь от цели обучения, интерактивность и виды оценивания.",
      demos: [{
          title: "Bi group",
          src: "./images/demo/bi-logo.png",
          text: "BI Group постоянно совершенствует процесс работы и одним из направлений является сокращение сроков строительства. Для решения этой задачи в 2020 году наша компания разработала для ВI ЦОР по практическому применению циклограммы для более эффективного планирования строительства.",
          content: [{
              title: "Практическая часть ЦОРа",
              media: [
                "./images/demo/bi-img-1.png",
              ]
            },
            {
              title: "Представление контента в виде схемы",
              media: [
                "./images/demo/bi-img-2.png",
              ]
            },
            {
              title: "Пример тестового задания",
              media: [
                "./images/demo/bi-img-3.png",
              ]
            },
          ],
          video: "./videos/demo/video.mp4",
        },
        {
          title: "CACG promo",
          src: "/images/demo/cacg-logo.png",
          text: "Для успешного ведения бизнеса нужны сотрудники, которые действуют быстро, принимают верные решения, а их знания актуальны. И здесь на помощь приходит онлайн образование. И задача любой компании, выпускающая такой продукт – обучение через применение образовательных и современных технологий.",
          content: [{
              title: "Примеры интерактива",
              media: [
                "./images/demo/cacg-img-1.png",
                "./images/demo/cacg-img-2.png",
              ]
            },
            {
              title: "",
              media: [
                "./images/demo/cacg-img-3.png",
                "./images/demo/cacg-img-4.png",
              ]
            },
            {
              title: "",
              media: [
                "./images/demo/cacg-img-5.png",
                "./images/demo/cacg-img-6.png",
              ]
            },
          ],
          video: "./videos/demo/video.mp4",
        },
        {
          title: "Складская Логистика",
          src: "/images/demo/log-logo.png",
          text: "Данный ЦОР предназначен для сотрудников в сфере транспортно-логистической системы, грузоперевозки, грузопереработки и его организации на складе. ЦОР представляет собой различные оптимальные форматы подачи информации, с помощью которых сотрудник уже во время работы может быстро и легко обратиться к нужной информации.",
          content: [{
            title: "Тестовые задания в виде перетаскивания",
            media: [
              "./images/demo/log-img-1.png",
            ]
          }, {
            title: "Представление контента в виде схемы",
            media: [
              "./images/demo/log-img-2.png",
            ]
          }, {
            title: "Задание на выбор нескольких правильных ответов",
            media: [
              "./images/demo/log-img-3.png",
            ]
          }, ],
        },
        {
          title: "Газовое Дело",
          src: "/images/demo/gas-logo.png",
          text: "ЦОР по газовому делу был разработан для сотрудников отрасли по переработке и транспортировке газа. Курс включает в себя интерактивные задания в процессе обучения, различные графики, анимации, 3D объекты и т.д. для передачи знаний и отработке практических навыков. Также используются различные виды оценки и проверки знаний для закрепления.",
          content: [{
            title: "Примеры интерактива",
            media: [
              "./images/demo/gas-img-1.png",
            ]
          }, {
            title: "Примеры интерактива",
            media: [
              "./images/demo/gas-img-2.png",
            ]
          }, {
            title: "Примеры интерактива",
            media: [
              "./images/demo/gas-img-3.png",
            ]
          }, ],
        },
      ],
      videoTxt: "Видео",
      btnMore: "Подробнее",
      mediaTitle: "Медиа",
      btnAll: "Все",
      btnReadMore: "Читать далее",
      mediaSimilarArticles: "Похожие статьи",
    },
    "KZ": {
      backAgain: "Басты бет",
      navMenuItemAbout: "Біз туралы",
      navMenuItemCompany: "Компания жайлы",
      navMenuItemTeam: "Команда туралы",
      navMenuItemMedia: "БАҚ",
      navMenuItemDemo: "Демо",
      btnMenu: "Мәзір",
      bannerTitleFirst: "Сандық",
      bannerTitleSecond: "технология",
      bannerTitleThird: "білім беру саласында",
      bannerTextFirst: "Қызметкерлерді оқытуға арналған сандық білім беру ресурстарын дайындау.",
      bannerTextSecond: "Білімді тексеру, статистиканы жинау және бағалауды автоматтандыру",
      btnDemo: "Демо",
      videoInfoTitle: "бұл дегеніміз...",
      videoInfoTextTitle: "Білім берудегі цифрландыру",
      videpInfoTextFirst: "- бұл білім беруді электронды форматқа ауыстыру ғана емес. Біздің курстар компанияның барлық инфрақұрылымын өзгертуге ықпал етеді, оның жұмысының әртүрлі аспектілерін тиімді етеді.",
      videpInfoTextSecond: "Сабақтарды мультимедиялық қолдаудың арқасында оқу уақыты 30% -ға дейін үнемделеді.",
      videpInfoTextThird: "Кадрлар бөлімі қызметкерлердің білімі мен дағдыларын бағалауға мүмкіндік беретін қуатты талдау құралын алады.",
      approachTitle: "жоба жасау тәсілі",
      approachSlides: [{
          id: "123",
          title: "Талдау",
          text: "Оқыту процесі - бұл А нүктесінен В нүктесіне дейінгі жол, және осы жолдың соңында біздің тыңдаушымыз жаңа білімді игеріп қана қоймай, сонымен қатар жаңа дағдыларын да дамытуы керек. Тиімді курсты дамытудың маңызды бөлігі \"талдау\" болып табылады. Оның өзі бірнеше кезеңге бөлінеді: қажеттіліктерді талдау, мақсатты аудиторияны талдау және оқу мақсаттары мен мазмұнды талдау.",
        },
        {
          id: "124",
          title: "Концепт құрастыру",
          text: "Болашақ курс құрылымы - бұл курстың мақсатына жетудің жол картасы. Бұл кезеңде жобаны іске асыруға қажет білім беру мақсаттары мен міндеттері қалыптасады, және материалды ұсыну логикасы, ақпарат ұсынудың форматы, сюжеттің негізгі жолдары және бағалау әдістері көрсетіледі.",
        },
        {
          id: "125",
          title: "Сценарий жазу",
          text: "Сценарий болашақ ЦОР-дың форматын сипаттайды. Оны жазу барысында оқытудың когнитивті тәсілін және оқу материалын ұсыну әдістемесін білу маңызды. Материалды қабылдаудың ерекшеліктерін, адамның оны қалай жақсы есте сақтауын, дағдылардың қалай қалыптасатынын, сонымен қатар курс барысында тыңдаушыны қалай қызықтыру керектігін ескеру қажет.",
        },
        {
          id: "126",
          title: "Дизайн",
          text: "Бұл кезеңде дайын сценарий курстың бірегей бейнелеуіне айналады. Ең кішкентай батырмадан бастап 3D нысандарға дейін бейнеленеді, курс интерфейсі жасалады, барлық қажетті элементтер салынады. Әзірленген курс дизайны - бұл болашақ курстың дайын визуалды көрінісі.",
        },
        {
          id: "127",
          title: "Бағдарлама жасау",
          text: "Бағдарлама жасаушылар дайын дизайнды жұмыс жобасына аударады. Жоба динамикалық көрініс табады. Интерактивті қолдануға, әртүрлі әрекеттерді жүзеге асыруға мүмкіндік пайда болады. Әр түрлі браузерлерде  сайттың адаптивті нұсқасы жасалады.",
        },
        {
          id: "128",
          title: "Тестілеу",
          text: "Курсты тестілеу қателерді анықтау, оларды түзету және тұтынушыға ыңғайлы болғанға дейін оқу үдерісін жақсарту үшін қажет. Ол үшін жобаны кешенді тексеру қажет: интерфейс пен навигация қаншалықты ыңғайлы және тиімді, сурет пен дыбыс қалай көрсетіледі, барлық түймелер жұмыс істей ме, курстың логикасы анық па, және тыңдаушы өздерін жайлы сезініп жатыр ма?",
        },
      ],
      counterTitle: "неге бізді таңдайды?",
      counterItemFirst: "Жылдық тәжірибе",
      counterItemSecond: "Оқытылған қызметкерлер",
      counterItemThird: "Жобалар аяқталды",
      teamSlides: [{
          id: "0",
          title: "Педдизайнер",
          text: [
            "E-learning — бұл электрондық оқыту. Біз курстарды адамдар жақсы жұмыс істеуі, қателік жібермеуі және оқуға деген ынтасы болуы үшін жасайды.",
          ],
          img: "./images/team/team1.jpg",
        },
        {
          id: "1",
          title: "Дизайнерлер",
          text: [
            "Біздің дизайнерлік топ болашақ курстың тұжырымдамасын ойластыра отырып, әр курсты ерекше, түсінікті және қол жетімді етеді.",
            "Түстер, иллюстрация, графика, анимация, корпоративті сәйкестендіру, 3D нысандар, интерфейс арқылы идеяларды визуалдау - бұл біздің шығармашылық жұмысымыздың кішкене бөлігі.",
          ],
          img: "./images/team/team2.jpg",
        },
        {
          id: "2",
          title: "Әзірлеушілер",
          text: [
            "Сандық технологияларды білімге енгізу тек оқу материалдарын электронды форматқа аудару ғана емес.",
            "Бірақ сонымен бірге, бұл бүкіл процестің маңызды кезеңдерінің бірі. Біздің әзірлеушілер тапсырыс берушінің барлық тілектері мен талаптарын жүзеге асыра отырып, дизайнерлердің идеяларын бағдарламалау тіліне аударады.",
          ],
          img: "./images/team/team3.jpg",
        },
        {
          id: "3",
          title: "Жоба жетекшісі",
          text: [
            "Жоба жетекшісінің негізгі жауапкершілігі - барлық ресурстарды пайдалана отырып, идеяны уақытында іске асыру.  Біздің менеджерлер барлық жобаны тұтастай көреді. Болатын мәселелерді қарастырып, қауіптердің алдын алады.",
            "Барлық қажеттіліктерді ескере отырып, жол картасын құрастырады. Қысқасы, жобаны басынан аяғына дейін ұйымдастырады.",
          ],
          img: "./images/team/team4.jpg",
        },
      ],
      demoTitle: "жұмыстарымыз",
      footerDataLegend: "Біздің мәліметтер",
      footerAddressLegend: "Біздің мекен-жайымыз",
      address: "Қабанбай батыр 5/1",
      footerEmailCaption: "Бізге хабарласыңыз:",
      footerCopyright: "©2021 CACG. Барлық құқық қорғалған",
      footerVerify: "Тексерілді <a href = '#'> <img style='margin-left: 0.5rem;vertical-align: middle' src='/images/astana-hub-logo.png' alt = '' /> </a>",
      componyTitle: "Компания жайлы",
      componyMainText: "CA Consulting Group электрондық оқыту саласында білім берудің сандық өнімдерін жасайды. Біз компанияларға күрделі техникалық дағдылар мен білімді қажет ететін қызметкерлерді оқытуға, сертификаттауға және дамытуға көмектесеміз. Біздің клиенттеріміз оқу курстарын қайта жаңарту мүмкіндігімен ыңғайлы және технологиялық шешім алады. Бастысы,  жүйелі оқыту курстарында және іссапарларда уақыт пен ақшаны үнемдейді.",
      componyChronology: [{
          id: "0",
          year: "2011",
          text: "Біздің компания құрылған жыл. Біз нені қалайтынымызды және білім беру курстарын (ЦОР) қалай дамытатындығымызды анық білдік.",
        },
        {
          id: "1",
          year: "2013",
          text: "Компанияның ресми ашылуы және жаңа жобалардың басталуы. Осы уақытқа дейін бірнеше жоба іске асырылды, және оның ішіндегі үлкен жобаларының бірі - НИБ үшін білім беру өнімін жасау.",
        },
      ],
      componySecondTitle: "Біздің қызметтеріміз",
      componyServices: [{
          title: "Жоба басқару",
          text: [
            "<p>Жоба жетекшісінің негізгі жауапкершілігі - барлық ресурстарды пайдалана отырып, идеяны уақытында іске асыру.  Біздің менеджерлер барлық жобаны тұтастай көреді.</p>",
            "<p>Болатын мәселелерді қарастырып, қауіптердің алдын алады. Барлық қажеттіліктерді ескере отырып, жол картасын құрастырады. Қысқасы, жобаны басынан аяғына дейін ұйымдастырады.</p>",
          ],
        },
        {
          title: "Оқу материалдарын құрастыру",
          text: [
            "<p>E-learning — бұл электрондық оқыту. Біздің педагогикалық дизайнерлеріміз курстарды адамдар жақсы жұмыс істеуі, қателік жібермеуі және оқуға деген ынтасы болуы үшін жасайды.</p>",
          ],
        },
        {
          title: "Дизайн әзірлеу",
          text: [
            "<p>Біздің дизайнерлік топ болашақ курстың тұжырымдамасын ойластыра отырып, әр курсты ерекше, түсінікті және қол жетімді етіп жеткізеді. Түстер, иллюстрация, графика, анимация, корпоративті сәйкестендіру, 3D нысандар, интерфейс арқылы идеяларды визуалдау - бұл біздің шығармашылық жұмысымыздың аз ғана бөлігі.</p>",
          ],
        },
        {
          title: "Бағдарлама жасау",
          text: [
            "<p>Сандық технологияларды білімге енгізу тек оқу материалдарын электронды форматқа аудару ғана емес. Бұл бүкіл процестің маңызды кезеңдерінің бірі. Біздің әзірлеушілер тапсырыс берушінің барлық тілектері мен талаптарын жүзеге асыра отырып, дизайнерлердің идеяларын бағдарламалау тіліне аударады.</p>",
          ],
        },
      ],
      componyTechnologies: [{
        src: "/images/technology-vue.png",
        title: "Vue.js framework",
        text: [
          "Бұл мақала Vue.js. керемет фреймворкқа назар аударады. Көріп отырғаныңыздай, мақала «Vue.js үшін күмәнділер» деп аталады, егер сіз әлі де Vue.js-ті тәжірибе жүзінде қолданып көруге шешім қабылдай алмасаңыз, оқығаннан кейін сіз мұны шешесіз деп үміттенемін.",
        ],
      }, ],
      componyThirdTitle: "қолданылатын технологиялар",
      teamTitle: "Команда туралы",
      teamMainText: "Біздің командада  20 қызметкер бар. Олардың әрқайсысы дара тұлға және өз саласының кәсіби маманы. Ең бастысы, біз бірге мықты командамыз!",
      teamPageSlides: [{
          src: "/images/team/team1.jpg",
          title: "Демо ЦОР 1",
        },
        {
          src: "/images/team/team2.jpg",
          title: "Демо ЦОР 2",
        },
        {
          src: "/images/team/team3.jpg",
          title: "Демо ЦОР 3",
        },
        {
          src: "/images/team/team4.jpg",
          title: "Демо ЦОР 4",
        },
        {
          src: "/images/team/team5.jpg",
          title: "Демо ЦОР 5",
        },
        {
          src: "/images/team/team6.jpg",
          title: "Демо ЦОР 6",
        },
        {
          src: "/images/team/team7.jpg",
          title: "Демо ЦОР 7",
        },
      ],
      teamSecondTitle: "Біздің ұстаным",
      teamPrinciples: [{
          id: "1",
          text: "Біз бір үлкен отбасы, бір организмбіз."
        },
        {
          id: "2",
          text: "Өзара көмек -  біздің негізіміз."
        }, {
          id: "3",
          text: "Шығармашылық пен жаңа бастама ұсыну әрқашан құпталады."
        }, {
          id: "4",
          text: "Біз «инновацияны» қолдаймыз!"
        }
      ],
      teamThirdTitle: "Бос жұмыс орындары",
      teamVacancies: [{
          title: "Дизайнер 3D",
          type: "vacancies",
          text: [
            `<span>Обязанности:</span><ul><li>3D моделирование необходимых объектов для дальнейшей визуализации</li><li>Разработка 3D сцены</li><li>Разработка объектов под специфику VR(это крутая возможность обучиться чему-то новому☺️)</li></ul>`,
            `<span>Требования:</span><ul><li>Наличие опыта моделирования 3D-объектов, их анимирования, текстурирования, настройки света и камер;</li><li>Владение как минимум двумя из нижеперечисленных программных пакетов (3ds Max, Cinema 4D, Blender, Adobe PhotoShop);</li><li>Креативное мышление</li></ul>`,
            `<span>Условия:</span><ul><li>Официальное трудоустройство</li><li>Уютная, теплая атмосфера в коллективе</li><li>Кофе, чай, печеньки)</li><li>Возможность обучения разработки моделей для пространства VR(есть своя специфика). Будет менторское сопровождение из России.</li><li>Заработная плата обсуждается на собеседовании (зависит от опыта, скорости и качества работы)</li></ul>`,
          ],
        },
        {
          title: "Графический дизайнер",
          type: "vacancies",
          text: [
            `<span>Обязанности:</span><ul><li>3D моделирование необходимых объектов для дальнейшей визуализации</li><li>Разработка 3D сцены</li><li>Разработка объектов под специфику VR(это крутая возможность обучиться чему-то новому☺️)</li></ul>`,
            `<span>Требования:</span><ul><li>Наличие опыта моделирования 3D-объектов, их анимирования, текстурирования, настройки света и камер;</li><li>Владение как минимум двумя из нижеперечисленных программных пакетов (3ds Max, Cinema 4D, Blender, Adobe PhotoShop);</li><li>Креативное мышление</li></ul>`,
            `<span>Условия:</span><ul><li>Официальное трудоустройство</li><li>Уютная, теплая атмосфера в коллективе</li><li>Кофе, чай, печеньки)</li><li>Возможность обучения разработки моделей для пространства VR(есть своя специфика). Будет менторское сопровождение из России.</li><li>Заработная плата обсуждается на собеседовании (зависит от опыта, скорости и качества работы)</li></ul>`,
          ],
        },
        {
          title: "front end разработчик",
          type: "vacancies",
          text: [
            `<span>Обязанности:</span><ul><li>3D моделирование необходимых объектов для дальнейшей визуализации</li><li>Разработка 3D сцены</li><li>Разработка объектов под специфику VR(это крутая возможность обучиться чему-то новому☺️)</li></ul>`,
            `<span>Требования:</span><ul><li>Наличие опыта моделирования 3D-объектов, их анимирования, текстурирования, настройки света и камер;</li><li>Владение как минимум двумя из нижеперечисленных программных пакетов (3ds Max, Cinema 4D, Blender, Adobe PhotoShop);</li><li>Креативное мышление</li></ul>`,
            `<span>Условия:</span><ul><li>Официальное трудоустройство</li><li>Уютная, теплая атмосфера в коллективе</li><li>Кофе, чай, печеньки)</li><li>Возможность обучения разработки моделей для пространства VR(есть своя специфика). Будет менторское сопровождение из России.</li><li>Заработная плата обсуждается на собеседовании (зависит от опыта, скорости и качества работы)</li></ul>`,
          ],
        },
      ],
      teamFourTitle: "Осында жұмыс істегім келеді",
      formEndText: "<p>рахмет!</p> <p>Біз сізге хабарласамыз.</p>",
      formNameLabel: "аты-жөніңіз",
      formNameError: "аты-жөніңіз енгізілмеген",
      formPositionLabel: "позиция",
      formPositionDefaultValue: "Таңдалмады",
      formPositions: [
        "Графикалық дизайнер",
        "Моушн дизайнері",
        "Front end программист",
      ],
      formFileLabel: "Түйіндеме",
      formFileDefaultValue: "Файл таңдалмады",
      formFileError: "Файл 10 МБ-тан аспауы керек",
      formBtn: "жіберу",
      demoPageTitle: "Демо",
      demoMainText: "Демо - бұл болашақ тапсырыс берушіге ұсынылатын жобалардың алдын-ала нұсқасы. Мұнда біз компанияның барлық бөлімшелерінің мүмкіндіктерін, оқу мақсатынан, интерактивтіліктен және бағалау түрлерінен бастап курсты құру логикасын көрсетеміз.",
      demos: [{
          title: "Bi group",
          src: "./images/demo/bi-logo.png",
          text: "BI Group өзінің жұмыс процесін үнемі жетілдіріп отырады және олардың бағыттарының бірі құрылыс уақытын қысқарту болып табылады. Бұл мәселені шешу және құрылысты тиімді жоспарлау мақсатында 2020 жылы біздің компания циклограмманы іс жүзінде қолдану бойынша BI компаниясына СОР әзірледі.",
          content: [{
              title: "СОР практикалық бөлімі",
              media: [
                "./images/demo/bi-img-1.png",
              ]
            },
            {
              title: "Мазмұнды сызба түрінде ұсыну",
              media: [
                "./images/demo/bi-img-2.png",
              ]
            },
            {
              title: "Тест тапсырмасының үлгісі",
              media: [
                "./images/demo/bi-img-3.png",
              ]
            },
          ],
          video: "./videos/demo/video.mp4",
        },
        {
          title: "CACG promo",
          src: "/images/demo/cacg-logo.png",
          text: "Табысты бизнес жылдам жұмыс істейтін, дұрыс шешім қабылдайтын қызметкерлерді қажет етеді, оған қоса олардың білімі де маңызды. Онлайн білім беру дәл осы тұста басталады. Мұндай өнімді шығаратын кез-келген компанияның міндеті - білім беру және заманауи технологияларды қолдану арқылы оқыту.",
          content: [{
              title: "Интерактивті тапсырмалардың мысалдары",
              media: [
                "./images/demo/cacg-img-1.png",
                "./images/demo/cacg-img-2.png",
              ]
            },
            {
              title: "",
              media: [
                "./images/demo/cacg-img-3.png",
                "./images/demo/cacg-img-4.png",
              ]
            },
            {
              title: "",
              media: [
                "./images/demo/cacg-img-5.png",
                "./images/demo/cacg-img-6.png",
              ]
            },
          ],
          video: "./videos/demo/video.mp4",
        },
        {
          title: "Қойма Логистикасы (Демо)",
          src: "/images/demo/log-logo.png",
          text: "Бұл СОР көлік-логистикалық жүйесі, жүктерді тасымалдау, жүктерді өңдеу және оны қоймада ұйымдастыру саласындағы қызметкерлерге арналған. СОР ақпарат ұсынуға арналған әр түрлі оңтайлы форматтарды ұсынады, оның көмегімен қызметкер жұмыс кезінде қажетті ақпараттарға тез және оңай қол жеткізе алады.",
          content: [{
            title: "Мәтінге сүйреп апару тест тапсырмалары",
            media: [
              "./images/demo/log-img-1.png",
            ]
          }, {
            title: "Мазмұнды сызба түрінде ұсыну",
            media: [
              "./images/demo/log-img-2.png",
            ]
          }, {
            title: "Бірнеше дұрыс жауаптарды таңдау тапсырмалары",
            media: [
              "./images/demo/log-img-3.png",
            ]
          }, ],
        },
        {
          title: "Газ Бизнесі (Демо)",
          src: "/images/demo/gas-logo.png",
          text: "Газ бизнесі бойынша СОР газды қайта өңдеу және тасымалдау саласының қызметкерлері үшін құрылған. Курс оқыту үдерісінде білімді  жеткізуге және тәжірибелік дағдыларды дамытуға арналған интерактивті тапсырмаларды, әртүрлі графиканы, анимацияларды, 3D нысандарын және т.б. құрайды. Сондай-ақ өтілген курсты бекіту үшін білімді бағалау мен тексерудің әр түрлі түрлері қолданылады.",
          content: [{
            title: "Оқу барысында маркерлер қолдану",
            media: [
              "./images/demo/gas-img-1.png",
            ]
          }, {
            title: "Бөлшектерді көрсету үшін маркерлерді қолдану",
            media: [
              "./images/demo/gas-img-2.png",
            ]
          }, {
            title: "Ашылмалы тізім",
            media: [
              "./images/demo/gas-img-3.png",
            ]
          }, ],
        },
      ],
      videoTxt: "Видео",
      btnMore: "Толығырақ",
      mediaTitle: "Медиа",
      btnAll: "Барлығы",
      btnReadMore: "ары қарай оқу",
      mediaSimilarArticles: "Ұқсас мақалалар",
    },
    "EN": {
      backAgain: "Home page",
      navMenuItemAbout: "About us",
      navMenuItemCompany: "About company",
      navMenuItemTeam: "About team",
      navMenuItemMedia: "Media",
      navMenuItemDemo: "Demo",
      btnMenu: "Menu",
      bannerTitleFirst: "digital",
      bannerTitleSecond: "technologies",
      bannerTitleThird: "in education",
      bannerTextFirst: "Development of digital educational resources for employee training",
      bannerTextSecond: "Automation of knowledge testing, statistics collection and assessment",
      btnDemo: "demo",
      videoInfoTitle: "How does it work?",
      videoInfoTextTitle: "Digitalization in education",
      videpInfoTextFirst: " is not just transferring education into electronic format. Our courses contribute to the transformation of the entire infrastructure of the company, making various aspects of its work more efficient.",
      videpInfoTextSecond: "Thanks to the multimedia support of classes, up to 30% of the study time is saved.",
      videpInfoTextThird: "The HR department receives a powerful analytics tool that allows you to assess the knowledge and skills of employees.",
      approachTitle: "Our approach",
      approachSlides: [{
          id: "1",
          title: "Stage of analysis",
          text: "The learning process is a path from point A to point B, and at the end of this path, our learner should not only acquire new knowledge and skills, but also develop new skills. Analysis is an important part of developing an effective course. This stage is broken down into several stages: needs analysis, target audience analysis, and learning objectives and content analysis. ",
        },
        {
          id: "2",
          title: "Drawing up a concept",
          text: "The structure of the future course is a road map for achieving the learning objective of the course. At this stage, learning objectives and tasks are formed that need to be solved in the process of implementing the project, the logic of the presentation of the material and the interactions used is laid, the format for presenting information, the main lines of the plot and methods of assessment are revealed.",
        },
        {
          id: "3",
          title: "Development of the script",
          text: "The scenario describes the format of the future DER, when writing it, it is important to know the cognitive approach to teaching and the methodology for providing educational material. It is necessary to take into account the peculiarities of the perception of the material, how a person remembers it better, how skills and abilities are formed, and also how to keep the learner involved during the course. In the correct learning process, learners should develop self-confidence and a sense of success.",
        },
        {
          id: "4",
          title: "Design development",
          text: "The developed scenario is embodied in a unique visualization of the course at the design stage. At this stage, from the smallest button to 3D objects are visualized, the course interface is designed, all the necessary elements are drawn. The developed course design is a ready-made view of the future course, but without the interactivity and functionality of the elements.",
        },
        {
          id: "5",
          title: "Development of the platform",
          text: "Developers transform the finished design into a working draft. The resource gets life, it becomes dynamic. There is an opportunity to use interactive, to implement different actions. At the stage of layout, an adaptive version of the site is developed, which opens on different browsers with different extensions.",
        },
        {
          id: "6",
          title: "Testing the project",
          text: "Testing the course is necessary to identify errors and fix them, improve the entire learning process before final delivery to the customer. We test and check everything: how convenient and effective the interface and navigation are, how the picture and sound are displayed, whether all the buttons work, whether the logic of the course is clear, and finally, whether the listener feels comfortable while using the DER.",
        },
      ],
      counterTitle: "Why choose us?",
      counterItemFirst: "years of experience",
      counterItemSecond: "trained employees",
      counterItemThird: "projects done",
      teamSlides: [{
          id: "0",
          title: "Instructional Designers",
          text: [
            "E-learning is about people: we make the course so that people work better, do not make mistakes, and be motivated to learn. And it's also about business: the more efficient the employee, the cooler the company! And the first step to creating such a course is made by an instructional designer, whose work begins with developing a script.",
          ],
          img: "./images/team/team1.jpg",
        },
        {
          id: "1",
          title: "Designers",
          text: [
            "Our design team makes each course unique, understandable and accessible, coming up with a concept for the future design. Visualization of ideas using color, illustration, graphics, animation, corporate identity, 3D objects, interface is a small part of our creative work.",
          ],
          img: "./images/team/team2.jpg",
        },
        {
          id: "2",
          title: "Developers",
          text: [
            "The introduction of digital technologies in education is not just transferring the educational materials into electronic format. But at the same time, this is one of the important stages of the whole process. Our developers translate the ideas of designers into the programming language, realizing all the wishes and requirements of the customer.",
          ],
          img: "./images/team/team3.jpg",
        },
        {
          id: "3",
          title: "Project Managers",
          text: [
            "The main responsibility of the PM is to bring the idea to implementation on time, using all resources. Sounds pretty peaceful, but every word hides a whole host of daunting challenges. Our managers see the whole project. Take into account the risks. Build a roadmap fully considering the needs of the client. Organizing the process from start to finish.",
          ],
          img: "./images/team/team4.jpg",
        },
      ],
      demoTitle: "Our projects",
      footerDataLegend: "Contacts",
      footerAddressLegend: "Address",
      address: "Kabanbay batyr st 5/1",
      footerEmailCaption: " Contact us:",
      footerCopyright: "©2021 CACG. All rights reserved",
      footerVerify: "Verified by <a href = '#'> <img style='margin-left: 0.5rem;vertical-align: middle' src='/images/astana-hub-logo.png' alt = '' /> </a>",
      componyTitle: "About company",
      componyMainText: "CA Consulting Group creates digital educational products in the field of e-learning. We help companies train, certify and develop employees who require complex technical skills and knowledge. Our clients save time and money on regular training courses, recertification and business trips, instead getting a convenient and technological solution with the ability to quickly update the content of training courses.",
      componyChronology: [{
          id: "0",
          year: "2011",
          text: "In this year our company took first step in its formation. We had a clear vision of what we want and how we will develop educational courses (DER).",
        },
        {
          id: "1",
          year: "2013",
          text: "In 2013 our company has officially begun to function and  started to work on its first projects. By this time, several DERs had been implemented, and one of the big projects was the development of an educational product for NIS.",
        },
      ],
      componySecondTitle: "Our services",
      componyServices: [{
          title: "Project management",
          text: [
            "<p>The main responsibility of the PM is to bring the idea to implementation on time, using all resources. Sounds pretty peaceful, but every word hides a whole host of daunting challenges. Our managers see the whole project. Take into account the risks. Build a roadmap fully considering the needs of the client. Organizing the process from start to finish.</p>",
          ],
        },
        {
          title: "Creating educational resources",
          text: [
            "<p>Instructional designers carefully study the materials provided by the customer. Usually these are large amounts of information that need to be processed and structured. Then the concept, logic is built, the necessary tools are selected for its presentation, and on the basis of all this, a course script is prepared. We involve an expert in the subject area, develop a unique design, and customize reporting for specific customer tasks.</p>",
            "<p>In the process of training, the employee actively performs practical tasks, studies 3D models of complex mechanisms, which can be viewed from different angles and disassembled into parts, checks and consolidates his knowledge.</p>"
          ],
        },
        {
          title: "Design development",
          text: [
            "<p>Our design team makes each course unique, understandable and accessible, coming up with a concept for the future design. Visualization of ideas using color, illustration, graphics, animation, corporate identity, 3D objects, interface is a small part of our creative work.</p>",
          ],
        },
        {
          title: "Development",
          text: [
            "<p>The introduction of digital technologies in education is not just transferring the educational materials into electronic format. But at the same time, this is one of the important stages of the whole process. Our developers translate the ideas of designers into the programming language, realizing all the wishes and requirements of the customer.</p>",
          ],
        },
      ],
      componyTechnologies: [{
        src: "/images/technology-vue.png",
        title: "Vue.js framework",
        text: [
          "Vue is an open-source model–view–viewmodel front end JavaScript framework for building user interfaces and single-page applications.  It was created by Evan You, and is maintained by him and the rest of the active core team members",
        ],
      }, ],
      componyThirdTitle: "Technology stack",
      teamTitle: "About team",
      teamMainText: "Our team includes 20 employees working hard on projects. Each of them is a successful person and a professional in their field, and together we are a strong team!",
      teamPageSlides: [{
          id: "0",
          src: "./images/team/team1.jpg",
        },
        {
          id: "1",
          src: "./images/team/team2.jpg",
        },
        {
          id: "2",
          src: "./images/team/team3.jpg",
        },
        {
          id: "3",
          src: "./images/team/team4.jpg",
        },
        {
          id: "4",
          src: "./images/team/team5.jpg",
        },
        {
          id: "5",
          src: "./images/team/team6.jpg",
        },
        {
          id: "6",
          src: "./images/team/team7.jpg",
        },
      ],
      teamSecondTitle: "our principles",
      teamPrinciples: [{
          id: "1",
          text: "We are one big family, one organism. If leg hurts, eyes cry - hands wipe away the tears"
        },
        {
          id: "2",
          text: "Mutual assistance is our foundation."
        }, {
          id: "3",
          text: "Creativity and initiative are always welcome."
        }, {
          id: "4",
          text: "We are for “innovation”! If it is convenient and in line with our values!"
        }
      ],
      teamThirdTitle: "Current vacancies",
      teamVacancies: [{
        title: "Designer 3D",
        type: "vacancies",
        text: [
          `<span>Обязанности:</span><ul><li>3D моделирование необходимых объектов для дальнейшей визуализации</li><li>Разработка 3D сцены</li><li>Разработка объектов под специфику VR(это крутая возможность обучиться чему-то новому☺️)</li></ul>`,
          `<span>Требования:</span><ul><li>Наличие опыта моделирования 3D-объектов, их анимирования, текстурирования, настройки света и камер;</li><li>Владение как минимум двумя из нижеперечисленных программных пакетов (3ds Max, Cinema 4D, Blender, Adobe PhotoShop);</li><li>Креативное мышление</li></ul>`,
          `<span>Условия:</span><ul><li>Официальное трудоустройство</li><li>Уютная, теплая атмосфера в коллективе</li><li>Кофе, чай, печеньки)</li><li>Возможность обучения разработки моделей для пространства VR(есть своя специфика). Будет менторское сопровождение из России.</li><li>Заработная плата обсуждается на собеседовании (зависит от опыта, скорости и качества работы)</li></ul>`,
        ],
      }],
      teamFourTitle: "I would like to work with you",
      formEndText: "<p>thank you!</p> <p>We will get back to you soon!</p>",
      formNameLabel: "your name",
      formNameError: "Name not entered",
      formPositionLabel: "position",
      formPositionDefaultValue: "Not choosen",
      formPositions: [
        "Graphic Designer",
        "Motion designer",
        "Front end programmer",
      ],
      formFileLabel: "cv",
      formFileDefaultValue: "File not choosen",
      formFileError: "The file should not exceed 10 MB",
      formBtn: "send",
      demoPageTitle: "Demo",
      demoMainText: "A demo is a preliminary version of projects presented to a future customer. Here we demonstrate the capabilities of all divisions of the company, show the logic of development of the course, starting from the learning objectives, activity and types of assessment.",
      demos: [{
          title: "Bi group",
          src: "./images/demo/bi-logo.png",
          text: "BI Group is constantly improving its work process and one of their directions is to reduce the construction time. In order to solve this problem and for more efficient construction planning, in 2020, our company has developed a DER for BI to  practically apply the cyclogram.",
          content: [{
              title: "Practical part of the DER",
              media: [
                "./images/demo/bi-img-1.png",
              ]
            },
            {
              title: "Presentation of content in the form of a diagram",
              media: [
                "./images/demo/bi-img-2.png",
              ]
            },
            {
              title: "Sample test task",
              media: [
                "./images/demo/bi-img-3.png",
              ]
            },
          ],
          video: "./videos/demo/video.mp4",
        },
        {
          title: "CACG promo",
          src: "/images/demo/cacg-logo.png",
          text: "Successful business requires employees who act quickly, make the right decisions, moreover their knowledge is relevant. This is where online education comes in. And the task of any company that produces such a product is training through the use of educational and modern technologies.",
          content: [{
              title: "Examples of the interactive tasks",
              media: [
                "./images/demo/cacg-img-1.png",
                "./images/demo/cacg-img-2.png",
              ]
            },
            {
              title: "",
              media: [
                "./images/demo/cacg-img-3.png",
                "./images/demo/cacg-img-4.png",
              ]
            },
            {
              title: "",
              media: [
                "./images/demo/cacg-img-5.png",
                "./images/demo/cacg-img-6.png",
              ]
            },
          ],
          video: "./videos/demo/video.mp4",
        },
        {
          title: "Warehouse Logistics (Demo)",
          src: "/images/demo/log-logo.png",
          text: "This DER is intended for employees in the field of the transport and logistics system, freight transport, freight handling and its organization in the warehouse. The DER represents various optimal formats for presenting information, with the help of which an employee can quickly and easily access the necessary information during work.",
          content: [{
            title: "Drag-and-drop questions",
            media: [
              "./images/demo/log-img-1.png",
            ]
          }, {
            title: "Presentation of content in the form of a diagram",
            media: [
              "./images/demo/log-img-2.png",
            ]
          }, {
            title: "Multiple choice questions",
            media: [
              "./images/demo/log-img-3.png",
            ]
          }, ],
        },
        {
          title: "Gas Business (Demo)",
          src: "/images/demo/gas-logo.png",
          text: "The DER of gas business was developed for the employees of the gas processing and transportation industry. The course includes interactive tasks in the learning process, various graphics, animations, 3D objects, etc. to transfer knowledge and practice practical skills. Also, various types of assessment and testing of knowledge are used to consolidate.",
          content: [{
            title: "Using markers in learning process",
            media: [
              "./images/demo/gas-img-1.png",
            ]
          }, {
            title: "Using markers to display the details of items",
            media: [
              "./images/demo/gas-img-2.png",
            ]
          }, {
            title: "Drop-down list",
            media: [
              "./images/demo/gas-img-3.png",
            ]
          }, ],
        },
      ],
      videoTxt: "Video",
      btnMore: "More details",
      mediaTitle: "Media",
      btnAll: "All",
      btnReadMore: "Read more",
      mediaSimilarArticles: "Similar articles",
    }
  }
})

export const getters = {
  _getScrollTop(state) {
    return state._scrollTop;
  },
  _getListeners(state) {
    return state._listeners;
  },
  _getLang(state) {
    return state._lang.toLowerCase();
  },
  _getLangs(state) {
    return Object.keys(state._translate);
  },
  _getBaseUrl(state) {
    return state._baseUrl
  },
  _getDictionary(state) {
    return state._translate[state._lang];
  }
}

export const mutations = {
  _SET_SCROLL_TOP(state, payload) {
    state._scrollTop = payload;
  },
  _ADD_LISTENER(state, payload) {
    state._listeners.push(payload);
  },
  _SET_LANG(state, payload) {
    state._lang = payload;
  }
}

export const actions = {
  _set_scroll_top({
    commit
  }, payload) {
    commit("_SET_SCROLL_TOP", payload);
  },
  _add_listener({
    commit
  }, payload) {
    commit("_ADD_LISTENER", payload);
  },
  _set_lang({
    commit
  }, payload) {
    localStorage.setItem("lang", payload);
    commit("_SET_LANG", payload);
  }
}
